podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/PORTA_MKL03Z4.svd.xml
<!--
Devices using this peripheral: 
      MKL04Z4
      MKL05Z4
      MKL14Z4
      MKL15Z4
      MKL16Z4
      MKL17Z4
      MKL24Z4
      MKL25Z4
      MKL26Z4
      MKL27Z4
      MKL27Z644
      MKL33Z4
      MKL34Z4
      MKL36Z4
      MKL43Z4
      MKL46Z4
      MKV10Z7
      MKV11Z7
      MKW01Z4
-->
      <peripheral>
         <?sourceFile "PORTA_MKL03Z4" ?>
         <name>PORTA</name>
         <description>Pin Control and Interrupts</description>
         <groupName>PORTA</groupName>
         <prependToName>PORTA</prependToName>
         <headerStructName>PORT</headerStructName>
         <baseAddress>0x40049000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x80</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x80</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0xA0</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <dim>32</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31</dimIndex>
               <name>PCR%s</name>
               <description>Pin Control Register %s</description>
               <addressOffset>0x0</addressOffset>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>PS</name>
                     <description>Pull Select\n
Selects between internal pull-up or down if enabled by PE bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Pull-down if enabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Pull-up if enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PE</name>
                     <description>Pull Enable\n
Enables internal pull-up down resistor</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Pull-up/down disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Pull-up/down enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SRE</name>
                     <description>Slew Rate Enable\n
Enables Slew Rate Limiting if the pin is configured as a digital output</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Fast slew rate</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Slow slew rate</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PFE</name>
                     <description>Passive Filter Enable\n
Enables Passive Input Filtering if the pin is configured as a digital input\n
A low pass filter of 10 MHz to 30 MHz bandwidth is used</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Filtering is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Filtering is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DSE</name>
                     <description>Drive Strength Enable\n
Enables High Drive Strength if pin is configured as a digital output</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Low drive strength</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>High drive strength</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MUX</name>
                     <description>Pin Mux Control\n
Select Pin Function</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b000</name>
                           <description>Pin Disabled (Analogue)</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b001</name>
                           <description>Alternative 1 (GPIO)</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b010</name>
                           <description>Alternative 2</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b011</name>
                           <description>Alternative 3</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b100</name>
                           <description>Alternative 4</description>
                           <value>0b100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b101</name>
                           <description>Alternative 5</description>
                           <value>0b101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b110</name>
                           <description>Alternative 6</description>
                           <value>0b110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b111</name>
                           <description>Alternative 7</description>
                           <value>0b111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IRQC</name>
                     <description>Interrupt Configuration\n
Configures Interrupt and DMA functions</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0000</name>
                           <description>Disabled</description>
                           <value>0b0000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0001</name>
                           <description>DMA Request on rising edge</description>
                           <value>0b0001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0010</name>
                           <description>DMA Request on falling edge</description>
                           <value>0b0010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0011</name>
                           <description>DMA Request on either edge</description>
                           <value>0b0011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1000</name>
                           <description>Interrupt when logic 0</description>
                           <value>0b1000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1001</name>
                           <description>Interrupt on rising edge</description>
                           <value>0b1001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1010</name>
                           <description>Interrupt on falling edge</description>
                           <value>0b1010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1011</name>
                           <description>Interrupt on either edge</description>
                           <value>0b1011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1100</name>
                           <description>Interrupt when logic 1</description>
                           <value>0b1100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0bXXXX</name>
                           <description>Reserved</description>
                           <isDefault>true</isDefault>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ISF</name>
                     <description>Interrupt Status Flag\n
Indicates if interrupt or DMA request has been detected.\n 
DMA requests are cleared automatically at the completion of the requested DMA transfer.\n
Interrupts remain set until a logic one is written to the flag</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No request</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Interrupt/DMA request</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>GPCLR</name>
               <description>Global Pin Control Low Register</description>
               <addressOffset>0x80</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>GPWD</name>
                     <description>Global Pin Write Data\n
This is the data to update PCR[15..0]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0bX</name>
                           <description>Value to update PCR</description>
                           <isDefault>true</isDefault>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>GPWE</name>
                     <description>Global Pin Write Enable\n
Each bit controls if the corresponding PCR register is updated (PCR[15..0])</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0bX</name>
                           <description>Write 1 to update PCR</description>
                           <isDefault>true</isDefault>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>GPCHR</name>
               <description>Global Pin Control High Register</description>
               <addressOffset>0x84</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>GPWD</name>
                     <description>Global Pin Write Data\n
This is the data to update PCR[15..0]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0bX</name>
                           <description>Value to update PCR</description>
                           <isDefault>true</isDefault>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>GPWE</name>
                     <description>Global Pin Write Enable\n
Each bit controls if the corresponding PCR register is updated (PCR[31..16])</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0bX</name>
                           <description>Write 1 to update PCR</description>
                           <isDefault>true</isDefault>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>ISFR</name>
               <description>Interrupt Status Flag Register\n
Reflects the interrupt status of each pin</description>
               <addressOffset>0xA0</addressOffset>
               <fields>
                  <field>
                     <name>ISF0</name>
                     <description>Interrupt Status Flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No interrupt</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Interrupt pending</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="ISF0" > <name>ISF1</name> <description>Interrupt Status Flag 1</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF2</name> <description>Interrupt Status Flag 2</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF3</name> <description>Interrupt Status Flag 3</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF4</name> <description>Interrupt Status Flag 4</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF5</name> <description>Interrupt Status Flag 5</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF6</name> <description>Interrupt Status Flag 6</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF7</name> <description>Interrupt Status Flag 7</description> <bitOffset>7</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF8</name> <description>Interrupt Status Flag 8</description> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF9</name> <description>Interrupt Status Flag 9</description> <bitOffset>9</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF10</name> <description>Interrupt Status Flag 10</description> <bitOffset>10</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF11</name> <description>Interrupt Status Flag 11</description> <bitOffset>11</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF12</name> <description>Interrupt Status Flag 12</description> <bitOffset>12</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF13</name> <description>Interrupt Status Flag 13</description> <bitOffset>13</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF14</name> <description>Interrupt Status Flag 14</description> <bitOffset>14</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF15</name> <description>Interrupt Status Flag 15</description> <bitOffset>15</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF16</name> <description>Interrupt Status Flag 16</description> <bitOffset>16</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF17</name> <description>Interrupt Status Flag 17</description> <bitOffset>17</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF18</name> <description>Interrupt Status Flag 18</description> <bitOffset>18</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF19</name> <description>Interrupt Status Flag 19</description> <bitOffset>19</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF20</name> <description>Interrupt Status Flag 20</description> <bitOffset>20</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF21</name> <description>Interrupt Status Flag 21</description> <bitOffset>21</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF22</name> <description>Interrupt Status Flag 22</description> <bitOffset>22</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF23</name> <description>Interrupt Status Flag 23</description> <bitOffset>23</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF24</name> <description>Interrupt Status Flag 24</description> <bitOffset>24</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF25</name> <description>Interrupt Status Flag 25</description> <bitOffset>25</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF26</name> <description>Interrupt Status Flag 26</description> <bitOffset>26</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF27</name> <description>Interrupt Status Flag 27</description> <bitOffset>27</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF28</name> <description>Interrupt Status Flag 28</description> <bitOffset>28</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF29</name> <description>Interrupt Status Flag 29</description> <bitOffset>29</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF30</name> <description>Interrupt Status Flag 30</description> <bitOffset>30</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF31</name> <description>Interrupt Status Flag 31</description> <bitOffset>31</bitOffset> </field>
               </fields>
            </register>
         </registers>
      </peripheral>
